---
kind: other
id: Properties.T:Autodesk.Revit.DB.IFC.RoofComponents
source: html/0aa100a0-f094-3c18-685f-5cee11bf8624.htm
---
# RoofComponents Properties

Specifies whether the .NET object represents a valid Revit entity.